/*********************************************************************************
//概述：
//作者：大胡子书生     时间：       地点：
//CPU型号：         系统主频：
//版本号：V0.0        
*********************************************************************************/
#ifndef __IIC_MB85RC512T_H__
#define __IIC_MB85RC512T_H__


/*********************************************************************************
文件包含区
*********************************************************************************/
#include "..\..\Projects\inc\SystemDefine.h"
/*********************************************************************************
宏定义区
*********************************************************************************/
#define FRAM_I2C_Speed         10000
#define FRAM_ADDRESS           0xA0
#define FRAM_PageSize          256
#define MB85RC512T_ADDRESS     0

//将缓冲器的数据写入EEPROM
#define FRAM_BufferWrite(Buffer, NumByteToWrite, WriteAddr)   FRAM_PageWrite((void*)Buffer, NumByteToWrite, WriteAddr)

//将EEPROM的数据读入缓冲器     
#define FRAM_BufferRead(Buffer, NumByteToRead, ReadAddr)   FRAM_PageRead((void*)Buffer, NumByteToRead, ReadAddr)
/*********************************************************************************
数据类型定义
*********************************************************************************/

/*********************************************************************************
外部变量声明区
*********************************************************************************/

/*********************************************************************************
函数声明区
*********************************************************************************/

SystemErrName FRAM_PageWrite(unsigned char* pBuffer, 
                             unsigned short NumByteToWrite,
                             unsigned short WriteAddr);


SystemErrName FRAM_PageRead(unsigned char* Buffer, 
                            unsigned short NumByteToRead,
                            unsigned short ReadAddr);
                          
/********************************************************************************/
#endif